//PRTKSDS1  JOB (KC03HEC),'PRINT EMPMASTI',CLASS=A,MSGCLASS=H
//STEP1     EXEC PGM=IDCAMS
//SYSPRINT  DD  SYSOUT=*
//VSAMFILE  DD  DSN=KC03HEC.EMPMASTI.KSDS,DISP=SHR
//SYSIN     DD  *
  PRINT INFILE(VSAMFILE) CHAR
/*
